Project3/fio/bs_sweep_rand_result.txt
rand4k: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
rand16k: (g=1): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=8
rand32k: (g=2): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=8
rand64k: (g=3): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
rand128k: (g=4): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=8
rand256k: (g=5): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=8
fio-3.36
Starting 6 processes
3;fio-3.36;rand4k;0;0;109669616;1827796;456949;60001;0;1819;1.379685;1.603954;6;2087;15.889886;9.280071;95.000000%=31;99.000000%=37;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;7;2091;17.269571;9.445141;1302184;2096128;100.000000%;1828619.571429;174463.202966;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;24.245000%;66.565000%;410152;0;18;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.10%;88.06%;11.64%;0.15%;0.04%;0.01%;0.01%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;70449367;1404;20;854;2776461;124;2776630;75.19%
3;fio-3.36;rand16k;1;0;321578768;5359556;334972;60001;1;981;2.270994;1.144842;10;1221;21.383392;5.842894;95.000000%=33;99.000000%=41;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;12;1226;23.654386;6.020545;3990560;5768672;100.000000%;5361867.823529;408126.847538;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;17.191667%;79.008333%;153151;0;42;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;48.30%;51.27%;0.40%;0.02%;0.01%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;70449367;1404;20;854;2776461;124;2776630;75.19%
3;fio-3.36;rand32k;2;0;365175520;6086157;190192;60001;2;1309;2.730558;0.982020;13;1357;39.170547;6.126210;95.000000%=41;99.000000%=58;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;15;1360;41.901105;6.213747;5304576;6167424;100.000000%;6089449.663866;128909.602740;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;9.608333%;69.583333%;7292028;0;74;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.01%;98.14%;1.76%;0.09%;0.01%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;70449367;1404;20;854;2776461;124;2776630;75.19%
3;fio-3.36;rand64k;3;0;367903552;6131623;95806;60001;3;338;4.195114;0.649509;18;2053;79.130697;9.892259;95.000000%=95;99.000000%=105;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;22;2079;83.325811;9.894196;6038784;6170240;100.000000%;6134681.596639;36457.782500;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;4.218333%;50.470000%;3803740;0;138;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.01%;0.05%;98.81%;1.10%;0.04%;0.01%;0.00%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;70449367;1404;20;854;2776461;124;2776630;75.19%
3;fio-3.36;rand128k;4;0;369766656;6162674;48145;60001;6;877;7.576835;1.246417;52;2099;158.377782;7.222296;95.000000%=160;99.000000%=162;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;60;2147;165.954618;7.176863;6142464;6176833;100.000000%;6165769.907563;5309.646800;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.425000%;44.581667%;2874044;0;266;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.12%;99.81%;0.06%;0.01%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;70449367;1404;20;854;2776461;124;2776630;75.19%
3;fio-3.36;rand256k;5;0;369507840;6158361;24056;60001;13;695;14.793223;2.182569;104;1874;317.544578;8.478171;95.000000%=321;99.000000%=325;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;118;1965;332.337801;8.280854;6143488;6171648;100.000000%;6160904.605042;6042.638028;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.261667%;40.595000%;1437731;0;520;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.13%;99.86%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;70449367;1404;20;854;2776461;124;2776630;75.19%

rand4k: (groupid=0, jobs=1): err= 0: pid=39516: Wed Oct  1 17:42:04 2025
  read: IOPS=457k, BW=1785MiB/s (1872MB/s)(105GiB/60001msec)
    slat (nsec): min=687, max=1819.4k, avg=1379.68, stdev=1603.95
    clat (usec): min=6, max=2087, avg=15.89, stdev= 9.28
     lat (usec): min=7, max=2091, avg=17.27, stdev= 9.45
    clat percentiles (nsec):
     |  95th=[31104],  99th=[37120]
   bw (  MiB/s): min= 1271, max= 2047, per=100.00%, avg=1785.76, stdev=170.37, samples=119
   iops        : min=325546, max=524032, avg=457154.90, stdev=43615.84, samples=119
  lat (usec)   : 10=0.10%, 20=88.06%, 50=11.64%, 100=0.15%, 250=0.04%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=24.25%, sys=66.56%, ctx=410152, majf=0, minf=18
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=27417404,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
rand16k: (groupid=1, jobs=1): err= 0: pid=39815: Wed Oct  1 17:42:04 2025
  read: IOPS=335k, BW=5234MiB/s (5488MB/s)(307GiB/60001msec)
    slat (nsec): min=1385, max=981296, avg=2270.99, stdev=1144.84
    clat (usec): min=10, max=1221, avg=21.38, stdev= 5.84
     lat (usec): min=12, max=1226, avg=23.65, stdev= 6.02
    clat percentiles (nsec):
     |  95th=[33536],  99th=[41728]
   bw (  MiB/s): min= 3897, max= 5633, per=100.00%, avg=5236.20, stdev=398.56, samples=119
   iops        : min=249410, max=360542, avg=335116.68, stdev=25507.98, samples=119
  lat (usec)   : 20=48.30%, 50=51.27%, 100=0.40%, 250=0.02%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=17.19%, sys=79.01%, ctx=153151, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=20098673,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
rand32k: (groupid=2, jobs=1): err= 0: pid=40121: Wed Oct  1 17:42:04 2025
  read: IOPS=190k, BW=5944MiB/s (6232MB/s)(348GiB/60001msec)
    slat (nsec): min=2209, max=1309.0k, avg=2730.56, stdev=982.02
    clat (usec): min=13, max=1357, avg=39.17, stdev= 6.13
     lat (usec): min=15, max=1360, avg=41.90, stdev= 6.21
    clat percentiles (nsec):
     |  95th=[41216],  99th=[58112]
   bw (  MiB/s): min= 5180, max= 6022, per=100.00%, avg=5946.73, stdev=125.89, samples=119
   iops        : min=165768, max=192732, avg=190295.18, stdev=4028.41, samples=119
  lat (usec)   : 20=0.01%, 50=98.14%, 100=1.76%, 250=0.09%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=9.61%, sys=69.58%, ctx=7292028, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=11411735,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
rand64k: (groupid=3, jobs=1): err= 0: pid=40399: Wed Oct  1 17:42:04 2025
  read: IOPS=95.8k, BW=5988MiB/s (6279MB/s)(351GiB/60001msec)
    slat (nsec): min=3697, max=338735, avg=4195.11, stdev=649.51
    clat (usec): min=18, max=2053, avg=79.13, stdev= 9.89
     lat (usec): min=22, max=2079, avg=83.33, stdev= 9.89
    clat percentiles (usec):
     |  95th=[   96],  99th=[  106]
   bw (  MiB/s): min= 5897, max= 6025, per=100.00%, avg=5990.90, stdev=35.60, samples=119
   iops        : min=94356, max=96410, avg=95854.29, stdev=569.68, samples=119
  lat (usec)   : 20=0.01%, 50=0.05%, 100=98.81%, 250=1.10%, 500=0.04%
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=4.22%, sys=50.47%, ctx=3803740, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5748493,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
rand128k: (groupid=4, jobs=1): err= 0: pid=40680: Wed Oct  1 17:42:04 2025
  read: IOPS=48.1k, BW=6018MiB/s (6311MB/s)(353GiB/60001msec)
    slat (usec): min=6, max=877, avg= 7.58, stdev= 1.25
    clat (usec): min=52, max=2099, avg=158.38, stdev= 7.22
     lat (usec): min=60, max=2147, avg=165.95, stdev= 7.18
    clat percentiles (usec):
     |  95th=[  161],  99th=[  163]
   bw (  MiB/s): min= 5998, max= 6032, per=100.00%, avg=6021.26, stdev= 5.19, samples=119
   iops        : min=47988, max=48256, avg=48169.99, stdev=41.48, samples=119
  lat (usec)   : 100=0.12%, 250=99.81%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.42%, sys=44.58%, ctx=2874044, majf=0, minf=266
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2888802,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
rand256k: (groupid=5, jobs=1): err= 0: pid=40959: Wed Oct  1 17:42:04 2025
  read: IOPS=24.1k, BW=6014MiB/s (6306MB/s)(352GiB/60001msec)
    slat (usec): min=13, max=695, avg=14.79, stdev= 2.18
    clat (usec): min=104, max=1874, avg=317.54, stdev= 8.48
     lat (usec): min=118, max=1965, avg=332.34, stdev= 8.28
    clat percentiles (usec):
     |  95th=[  322],  99th=[  326]
   bw (  MiB/s): min= 5999, max= 6027, per=100.00%, avg=6016.51, stdev= 5.90, samples=119
   iops        : min=23998, max=24108, avg=24066.03, stdev=23.60, samples=119
  lat (usec)   : 250=0.13%, 500=99.86%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=1.26%, sys=40.59%, ctx=1437731, majf=0, minf=520
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1443390,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1785MiB/s (1872MB/s), 1785MiB/s-1785MiB/s (1872MB/s-1872MB/s), io=105GiB (112GB), run=60001-60001msec

Run status group 1 (all jobs):
   READ: bw=5234MiB/s (5488MB/s), 5234MiB/s-5234MiB/s (5488MB/s-5488MB/s), io=307GiB (329GB), run=60001-60001msec

Run status group 2 (all jobs):
   READ: bw=5944MiB/s (6232MB/s), 5944MiB/s-5944MiB/s (6232MB/s-6232MB/s), io=348GiB (374GB), run=60001-60001msec

Run status group 3 (all jobs):
   READ: bw=5988MiB/s (6279MB/s), 5988MiB/s-5988MiB/s (6279MB/s-6279MB/s), io=351GiB (377GB), run=60001-60001msec

Run status group 4 (all jobs):
   READ: bw=6018MiB/s (6311MB/s), 6018MiB/s-6018MiB/s (6311MB/s-6311MB/s), io=353GiB (379GB), run=60001-60001msec

Run status group 5 (all jobs):
   READ: bw=6014MiB/s (6306MB/s), 6014MiB/s-6014MiB/s (6306MB/s-6306MB/s), io=352GiB (378GB), run=60001-60001msec

Disk stats (read/write):
  nvme0n1: ios=70449367/1404, sectors=3806442176/55952, merge=20/854, ticks=2776461/124, in_queue=2776630, util=75.19%